// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
    

int a = 2;
int b = 10;
if(a > b)
{
    Console.WriteLine("max = " + a);
} 
else if(a < b)
{
    Console.WriteLine("max = " + b);
}

